
<!doctype html>
<html lang="en" class="no-js">
  <head>
    
      <meta charset="utf-8">
      <meta name="viewport" content="width=device-width,initial-scale=1">
      
      
      
        <link rel="canonical" href="https://syssec25/lab2/">
      
      
        <link rel="prev" href="../lab1/">
      
      
      
      <link rel="icon" href="../assets/images/favicon.png">
      <meta name="generator" content="mkdocs-1.6.1, mkdocs-material-9.6.5">
    
    
      
        <title>Lab 2 - 浙江大学25年春夏系统安全实验</title>
      
    
    
      <link rel="stylesheet" href="../assets/stylesheets/main.8608ea7d.min.css">
      
        
        <link rel="stylesheet" href="../assets/stylesheets/palette.06af60db.min.css">
      
      


    
    
      
    
    
      
        
        
        <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
        <link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Roboto:300,300i,400,400i,700,700i%7CRoboto+Mono:400,400i,700,700i&display=fallback">
        <style>:root{--md-text-font:"Roboto";--md-code-font:"Roboto Mono"}</style>
      
    
    
    <script>__md_scope=new URL("..",location),__md_hash=e=>[...e].reduce(((e,_)=>(e<<5)-e+_.charCodeAt(0)),0),__md_get=(e,_=localStorage,t=__md_scope)=>JSON.parse(_.getItem(t.pathname+"."+e)),__md_set=(e,_,t=localStorage,a=__md_scope)=>{try{t.setItem(a.pathname+"."+e,JSON.stringify(_))}catch(e){}}</script>
    
      

    
    
    
  </head>
  
  
    
    
      

<p><div class="highlight"><table class="highlighttable"><tr><td class="linenos"><div class="linenodiv"><pre><span></span><span class="normal">1</span></pre></div></td><td class="code"><div><pre><span></span><code><span class="n">ioctl</span><span class="p">(</span><span class="n">fd</span><span class="p">,</span><span class="w"> </span><span class="mh">0x0001</span><span class="p">,</span><span class="w"> </span><span class="n">BUF_SIZE</span><span class="p">);</span><span class="w"> </span><span class="c1">//其中0x0001为命令号，BUF_SIZE为要求的内核缓冲区大小。</span>
</code></pre></div></td></tr></table></div>
* <strong>close</strong>:</p>
</li>
<li>
<p>功能:关闭该设备，释放内核缓冲区。</p>
</li>
<li>
<p>用户态使用范例：</p>
<div class="highlight"><table class="highlighttable"><tr><td class="linenos"><div class="linenodiv"><pre><span></span><span class="normal">1</span></pre></div></td><td class="code"><div><pre><span></span><code><span class="n">close</span><span class="p">(</span><span class="n">fd</span><span class="p">);</span><span class="w"> </span><span class="c1">//通过close系统调用关闭文件句柄。</span>
</code></pre></div></td></tr></table></div>
</li>
</ul>
<blockquote>
<p>我们代码中写了有printk打印，但其可能并不会被直接打印显示，解决办法有两种</p>
<ul>
<li>使用dmesg命令查看</li>
<li>如果你~~财力~~时间~~雄厚~~充足，可以给printk加入诸如KERN_EMERG/ALERT的参数然后重新编译kernel才能在命令行直接显示printk的消息：  <code>printk(KERN_EMERG “halo~~\n”);</code></li>
</ul>
</blockquote>
<h3 id="53-uaf">5.3 UAF漏洞介绍</h3>
<p>由于内核中该设备只有全局一个缓冲区，如果将设备打开两次，第二次打开的设备会覆盖第一次打开设备的缓冲区，且两次打开设备时候，我们可以获得指向同一个设备缓冲区的两个指针。此时如果释放其中一个设备，由于在释放的时候指针没有置空，此时便可以通过另一个文件描述符操作该缓冲区对应的内存，即存在 UAF 漏洞。</p>
<p>同时实验提供的 ioctl 接口能够调整这个缓冲区大小如果将其调整成内核中某个数据结构的大小，当内核分配相同大小的数据结构时，便会使用这块由我们控制的缓冲区，由此我们便可以控制内核的关键数据结构，最终达到 root 权限的目的。</p>
<h3 id="54-struct">5.4 struct结构介绍</h3>
<p><code>tty_struct</code>：</p>
<div class="highlight"><table class="highlighttable"><tr><td class="linenos"><div class="linenodiv"><pre><span></span><span class="normal"> 1</span>
<span class="normal"> 2</span>
<span class="normal"> 3</span>
<span class="normal"> 4</span>
<span class="normal"> 5</span>
<span class="normal"> 6</span>
<span class="normal"> 7</span>
<span class="normal"> 8</span>
<span class="normal"> 9</span>
<span class="normal">10</span>
<span class="normal">11</span>
<span class="normal">12</span>
<span class="normal">13</span>
<span class="normal">14</span>
<span class="normal">15</span>
<span class="normal">16</span>
<span class="normal">17</span>
<span class="normal">18</span>
<span class="normal">19</span>
<span class="normal">20</span>
<span class="normal">21</span>
<span class="normal">22</span>
<span class="normal">23</span>
<span class="normal">24</span>
<span class="normal">25</span>
<span class="normal">26</span>
<span class="normal">27</span>
<span class="normal">28</span>
<span class="normal">29</span></pre></div></td><td class="code"><div><pre><span></span><code><span class="cm">/* offset    |  size */</span><span class="w">  </span><span class="n">type</span><span class="w"> </span><span class="o">=</span><span class="w"> </span><span class="k">struct</span><span class="w"> </span><span class="nc">tty_struct</span><span class="w"> </span><span class="p">{</span>
<span class="cm">/*    0      |     4 */</span><span class="w">    </span><span class="kt">int</span><span class="w"> </span><span class="n">magic</span><span class="p">;</span>
<span class="cm">/*    4      |     4 */</span><span class="w">    </span><span class="k">struct</span><span class="w"> </span><span class="nc">kref</span><span class="w"> </span><span class="p">{</span>
<span class="cm">/*    4      |     4 */</span><span class="w">        </span><span class="n">refcount_t</span><span class="w"> </span><span class="n">refcount</span><span class="p">;</span>

<span class="w">                               </span><span class="cm">/* total size (bytes):    4 */</span>
<span class="w">                           </span><span class="p">}</span><span class="w"> </span><span class="n">kref</span><span class="p">;</span>
<span class="cm">/*    8      |     8 */</span><span class="w">    </span><span class="k">struct</span><span class="w"> </span><span class="nc">device</span><span class="w"> </span><span class="o">*</span><span class="n">dev</span><span class="p">;</span>
<span class="cm">/*   16      |     8 */</span><span class="w">    </span><span class="k">struct</span><span class="w"> </span><span class="nc">tty_driver</span><span class="w"> </span><span class="o">*</span><span class="n">driver</span><span class="p">;</span>
<span class="cm">/*   24      |     8 */</span><span class="w">    </span><span class="k">const</span><span class="w"> </span><span class="k">struct</span><span class="w"> </span><span class="nc">tty_operations</span><span class="w"> </span><span class="o">*</span><span class="n">ops</span><span class="p">;</span>
<span class="cm">/*   32      |     4 */</span><span class="w">    </span><span class="kt">int</span><span class="w"> </span><span class="n">index</span><span class="p">;</span>
<span class="cm">/* XXX  4-byte hole  */</span>
<span class="cm">/*   40      |    48 */</span><span class="w">    </span><span class="k">struct</span><span class="w"> </span><span class="nc">ld_semaphore</span><span class="w"> </span><span class="p">{</span>
<span class="cm">/*   40      |     8 */</span><span class="w">        </span><span class="n">atomic_long_t</span><span class="w"> </span><span class="n">count</span><span class="p">;</span>
<span class="cm">/*   48      |     4 */</span><span class="w">        </span><span class="n">raw_spinlock_t</span><span class="w"> </span><span class="n">wait_lock</span><span class="p">;</span>
<span class="cm">/*   52      |     4 */</span><span class="w">        </span><span class="kt">unsigned</span><span class="w"> </span><span class="kt">int</span><span class="w"> </span><span class="n">wait_readers</span><span class="p">;</span>
<span class="cm">/*   56      |    16 */</span><span class="w">        </span><span class="k">struct</span><span class="w"> </span><span class="nc">list_head</span><span class="w"> </span><span class="p">{</span>
<span class="cm">/*   56      |     8 */</span><span class="w">            </span><span class="k">struct</span><span class="w"> </span><span class="nc">list_head</span><span class="w"> </span><span class="o">*</span><span class="n">next</span><span class="p">;</span>
<span class="cm">/*   64      |     8 */</span><span class="w">            </span><span class="k">struct</span><span class="w"> </span><span class="nc">list_head</span><span class="w"> </span><span class="o">*</span><span class="n">prev</span><span class="p">;</span>

<span class="w">                                   </span><span class="cm">/* total size (bytes):   16 */</span>
<span class="w">                               </span><span class="p">}</span><span class="w"> </span><span class="n">read_wait</span><span class="p">;</span>
<span class="cm">/*   72      |    16 */</span><span class="w">        </span><span class="k">struct</span><span class="w"> </span><span class="nc">list_head</span><span class="w"> </span><span class="p">{</span>
<span class="cm">/*   72      |     8 */</span><span class="w">            </span><span class="k">struct</span><span class="w"> </span><span class="nc">list_head</span><span class="w"> </span><span class="o">*</span><span class="n">next</span><span class="p">;</span>
<span class="cm">/*   80      |     8 */</span><span class="w">            </span><span class="k">struct</span><span class="w"> </span><span class="nc">list_head</span><span class="w"> </span><span class="o">*</span><span class="n">prev</span><span class="p">;</span>

<span class="w">                                   </span><span class="cm">/* total size (bytes):   16 */</span>
<span class="w">                               </span><span class="p">}</span><span class="w"> </span><span class="n">write_wait</span><span class="p">;</span>
<span class="p">...</span>
</code></pre></div></td></tr></table></div>
<h2 id="6">6 实验任务</h2>
<p>本次实验分为三个小任务，每个小任务难度逐层递进，实验最终要求是获取 root 权限下可读文件中的 flag，并写入自己的实验报告中提交。<strong>本次实验可能会涉及 ASLR，为了简化实验，本次实验提供了 gdb 和 System.map 文件，可以间接绕过。</strong></p>
<h3 id="61-task1">6.1 Task1：设备接口的使用。</h3>
<ul>
<li>编写程序，尝试使用设备接口。</li>
